{
  "day 5 2025 March 25": [
    {
      "W": "dam",
      "C": "水坝",
      "Phrase": "The dam keeps the river from flooding the town."
    },
    {
      "W": "palatable",
      "C": "可口的美味的",
      "Phrase": "The girl found this dish to be palatable."
    },
    {
      "W": "noxious",
      "C": "有毒的",
      "Phrase": "The new painted room gave off a noxious smell and made the boy uncomfortable."
    },
    {
      "W": "dictate",
      "C": "口述、命令",
      "Phrase": "I dictate a letter to my secretary."
    },
    {
      "W": "bid",
      "C": "中标",
      "Phrase": "The winning bid in the auction was $5."
    },
    {
      "W": "noting to do with",
      "C": "与...无关",
      "Phrase": "The little boy told his mother that he had noting to do with the broken vase."
    },
    {
      "W": "cleared out",
      "C": "撤离、清空",
      "Phrase": "When the earthquake hit, people cleared out of the building swiftly."
    },
    {
      "W": "lofty",
      "C": "崇高的、巍峨的",
      "Phrase": "This mountain's lofty peak towers through the clouds."
    },
    {
      "W": "dot",
      "C": "点、小圆点",
      "Phrase": "Ladybugs have several black dots on their backs."
    },
    {
      "W": "sprint",
      "C": "冲刺",
      "Phrase": "All the athletes sprint to the finish line to try and win the race."
    },
    {
      "W": "opposite",
      "C": "相反",
      "Phrase": "She is running in the opposite direction of all the others."
    },
    {
      "W": "hectic",
      "C": "忙碌",
      "Phrase": "He hopes to have more hands to get through this hectic day!"
    },
    {
      "W": "pastime",
      "C": "消遣",
      "Phrase": "Reading has long been considered to be an enjoyable pastime for many people."
    },
    {
      "W": "solemn",
      "C": "庄严、严肃、不苟言笑",
      "Phrase": "His father is a solemn man and rarely smiles."
    },
    {
      "W": "synthesis",
      "C": "合成",
      "Phrase": "The liquid in the conical beaker is a synthesis of many different chemicals."
    },
    {
      "W": "bleach",
      "C": "漂白",
      "Phrase": "She has bleached her hair blonde."
    },
    {
      "W": "out of stock",
      "C": "脱销",
      "Phrase": "Sorry, milk is temporarlly out of stock.We'll have more in tomorrow."
    },
    {
      "W": "magnitude",
      "C": "地震震级、巨大幅度",
      "Phrase": "The horrible earthquake here had a magnitude of 8.0."
    },
    {
      "W": "take in",
      "C": "",
      "Phrase": "This couple took the lost backpacker in because it was dark outside."
    }
  ],
  "day 6 2025 April 17": [
    {
      "W": "spray",
      "C": "n. 喷雾, 浪花; v. 喷射, 喷洒",
      "Phrase": "We can use this spray to make the house smell better."
    },
    {
      "W": "afflict",
      "C": "v. 折磨, 使苦恼, 使痛苦",
      "Phrase": "She is afflicted by a bad headache."
    },
    {
      "W": "segment",
      "C": "n. 部分, 段, 节; v. 分割, 划分",
      "Phrase": "Obviously, this is only a segment of the entire pizza."
    },
    {
      "W": "entitle",
      "C": "v. 给...命名/题名, 使有资格",
      "Phrase": "The book is entitled The Journey to the West."
    },
    {
      "W": "supreme",
      "C": "adj. 至高无上的, 最高的, 最重要的",
      "Phrase": "The king has supreme power in his country."
    },
    {
      "W": "terse",
      "C": "adj. 简洁的, 简短的, 精练的",
      "Phrase": "He made a terse statement about this matter."
    },
    {
      "W": "aquatic",
      "C": "adj. 水生的, 水栖的, 水中的",
      "Phrase": "Under the sea, there are various aquatic creatures."
    },
    {
      "W": "hit it off",
      "C": "phr. (短语) 一拍即合, 情投意合, 相处融洽",
      "Phrase": "When he compared my music to high mountains and flowing water,we hit it off."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The businesswoman looks at her computer in confusion."
    },
    {
      "W": "giggle",
      "C": "v. 咯咯地笑, 傻笑; n. 咯咯的笑声",
      "Phrase": "The little baby can't stop giggling when having his first swimming."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "the teacher gave out the exam papers."
    },
    {
      "W": "passive",
      "C": "adj. 被动的, 消极的; n. 被动语态",
      "Phrase": "Passive smoking causes great harm to children and pregnant women."
    },
    {
      "W": "resilience",
      "C": "n. 恢复力, 韧性, 弹力",
      "Phrase": "The turtle showed its resilience and successfully reached the ocean."
    },
    {
      "W": "ease",
      "C": "v. 减轻, 缓解, 使舒适; n. 舒适, 安逸",
      "Phrase": "To ease her daily stress, she likes to practice yogga."
    },
    {
      "W": "knot",
      "C": "n. (绳)结, (树)节, 难点; v. 打结",
      "Phrase": "She unties the knot."
    },
    {
      "W": "apprehension",
      "C": "n. 忧虑, 担心, 理解, 逮捕",
      "Phrase": "I have some apprehensions about this business deal."
    },
    {
      "W": "regulate",
      "C": "v. 管理, 控制, 调节, 校准",
      "Phrase": "This guy's duty is to regulate the trafffic."
    },
    {
      "W": "bite",
      "C": "v. 咬, 叮; n. 咬伤, 一口之量",
      "Phrase": "The little boy is biting its toy."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "He is looking forward to seeing her after receiving her reply."
    },
    {
      "W": "content",
      "C": "n. 内容, 目录, 含量; adj. 满足的, 满意的; v. 使满足",
      "Phrase": "You can get a brief idea of a book from the table of contents."
    }
  ],
  "day2 Feb.13": [
    {
      "W": "",
      "C": "",
      "Phrase": "Having been painting since daybreak, the painter finally decided to call it a day."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The partner tore up the contract, which made it null and void."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "That orange is covered in mildew!I don't want it."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "She reckons on being the Olympic champion in 2020."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Polar bears only live in Arctic areas; you can't find them farther south."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "His parents took him to the theme park, and it made his day."
    },
    {
      "W": "maternal",
      "C": "",
      "Phrase": "The crazy fans were showing their maternal love for the there boys."
    },
    {
      "W": "underestimate",
      "C": "",
      "Phrase": "The boxer underestimated the strength of his opponent."
    },
    {
      "W": "vocational",
      "C": "",
      "Phrase": "I learned how to drive this in vocational school."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "She stood there and clutched a bunch of flowers."
    }
  ],
  "day3 2025 Feb. 22": [
    {
      "W": "ardent",
      "C": "积极的热情的",
      "Phrase": "She is an ardent supporter of a creative application."
    },
    {
      "W": "comprise",
      "C": "包括",
      "Phrase": "These animals comprise most of the cat family."
    },
    {
      "W": "clumsy",
      "C": "笨拙的",
      "Phrase": "The clumsy dog tried to jump high."
    },
    {
      "W": "steadfast",
      "C": "坚定",
      "Phrase": "If you remain steadfast in your belief, you have a higher chance of succeeding."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "They're marching together to show solidarity with their leader in their fight for environmental reform."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "These fibers are synthetic."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The science teacher is teaching about chemical compounds."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The kiwi sacrificed his life to protect his family and friends"
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The specialist conducted a valuation of the antique vase."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The red and blue parts merge into each other to make a heart."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The gaudy style is all the rage with the younger generation now."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Dairy foods contain lots of calcium."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Look at the crystal chandelier glittering.It's so beautiful."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The scene is so picturesque with its flowers and glowing sunlight."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The old artillery has been put by the seaside for many years."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "A pencil has a pointed shape."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "A geology field trip is necessary for studying geology."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "She pulled over at the side of the road and waited for help."
    }
  ],
  "day3 Febuary 25": [
    {
      "W": "",
      "C": "",
      "Phrase": "The old couple look back on their wedding with fond memories."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The app update incorporates many new features and improvements."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "He unfolds the map to see which way to go next."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Weeks after losing his job, he pulled himself together and started looking for new opportunities."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "She left her phone behind when leaving for work."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The adorable baby is resting in the cradle."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Atoms are very small particles."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Reciprocal relationships contribute to a good neighborhood."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "What really disgusts me is eating an entire worm in the apple."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The policeman found the man's behavior suspicious."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "He managed to deflect the arrow so it pointed upward"
    },
    {
      "W": "",
      "C": "",
      "Phrase": "He was hasty when running to the office."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "His mood has a lot to do with the change of weather."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "She mounted her horse and rode away."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "It's easy to distinguish the blue man from the gray men."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The waitress is clearing away the plates."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "I bought a small Eiffel tower as a memento of my trip."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "I want to pick that cluster of delicious grapes and eat them all!"
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Cash payments are gradually being phased out by the Chinese youth."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "As long as you can still grab a breath, you fight."
    }
  ],
  "day4 2025 Febuary 28": [
    {
      "W": "concrete",
      "C": "喷雾",
      "Phrase": "The workers are mixing the concrete together."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "You can only get round the obstacle by going off the road."
    },
    {
      "W": "cellar",
      "C": "部分",
      "Phrase": "The cellar is filled with wine barrels."
    },
    {
      "W": "fickle",
      "C": "给...命名/题名",
      "Phrase": "He has been notoriously fickle."
    },
    {
      "W": "courtesy",
      "C": "至高无上的",
      "Phrase": "She was treated with the utmost courtesy by the staff."
    },
    {
      "W": "likewise",
      "C": "简洁的，简短的",
      "Phrase": "The big man hates the small man; likewise, the small man hates the big man."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "This diamond isn't fake-I'm sure it's authentic."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "You'd better not lose your grip on the rock for your safety."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The trail had been paved with stone."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "I made a lot of money from my lucrative investments."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "He foresaw a delay of his journey due to the bad weather."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "I slipped right next to the \"Wet Floor\"sign which was really an irony."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Two points will be deducted for a wrong answer."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "Ugh! My back feels so sore!"
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The celebrity is endorsing the brand's lipstick."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "This is an aerial view of our city."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "I eject the DVD from the DVD player."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "A large boat anchored at the berth."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "The father and the son are playing with cushions."
    },
    {
      "W": "",
      "C": "",
      "Phrase": "No rabbits survived the massacre under the authority of the fox king."
    }
  ]
}